ssh://liu@10.50.21.134:22/home/liu/anaconda3/envs/haoran/bin/python -u /home/liu/chenhaoran/Mymodel_wkl/model/model_812.py
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 320, 320]           9,472
              ReLU-2         [-1, 64, 320, 320]               0
       BatchNorm2d-3         [-1, 64, 320, 320]             128
              ReLU-4         [-1, 64, 320, 320]               0
            Conv2d-5         [-1, 32, 320, 320]           2,080
       BatchNorm2d-6         [-1, 32, 320, 320]              64
              ReLU-7         [-1, 32, 320, 320]               0
            Conv2d-8         [-1, 32, 320, 320]           9,248
       BatchNorm2d-9         [-1, 32, 320, 320]              64
             ReLU-10         [-1, 32, 320, 320]               0
           Conv2d-11         [-1, 64, 320, 320]           2,112
      BatchNorm2d-12         [-1, 64, 320, 320]             128
         ResBlock-13         [-1, 64, 320, 320]               0
           Conv2d-14         [-1, 64, 320, 320]           4,160
      BatchNorm2d-15         [-1, 64, 320, 320]             128
           Conv2d-16         [-1, 32, 320, 320]           2,080
      BatchNorm2d-17         [-1, 32, 320, 320]              64
             ReLU-18         [-1, 32, 320, 320]               0
           Conv2d-19         [-1, 32, 320, 320]           9,248
      BatchNorm2d-20         [-1, 32, 320, 320]              64
             ReLU-21         [-1, 32, 320, 320]               0
           Conv2d-22         [-1, 64, 320, 320]           2,112
      BatchNorm2d-23         [-1, 64, 320, 320]             128
         ResBlock-24         [-1, 64, 320, 320]               0
           Conv2d-25         [-1, 64, 320, 320]           4,160
      BatchNorm2d-26         [-1, 64, 320, 320]             128
             ReLU-27         [-1, 64, 320, 320]               0
           Conv2d-28         [-1, 64, 160, 160]           4,160
      BatchNorm2d-29         [-1, 64, 160, 160]             128
             ReLU-30         [-1, 64, 160, 160]               0
           Conv2d-31         [-1, 64, 160, 160]           4,160
      BatchNorm2d-32         [-1, 64, 160, 160]             128
             ReLU-33         [-1, 64, 160, 160]               0
           Conv2d-34         [-1, 64, 160, 160]          36,928
      BatchNorm2d-35         [-1, 64, 160, 160]             128
             ReLU-36         [-1, 64, 160, 160]               0
           Conv2d-37        [-1, 128, 160, 160]           8,320
      BatchNorm2d-38        [-1, 128, 160, 160]             256
         ResBlock-39        [-1, 128, 160, 160]               0
           Conv2d-40        [-1, 128, 160, 160]           8,320
      BatchNorm2d-41        [-1, 128, 160, 160]             256
           Conv2d-42         [-1, 64, 160, 160]           8,256
      BatchNorm2d-43         [-1, 64, 160, 160]             128
             ReLU-44         [-1, 64, 160, 160]               0
           Conv2d-45         [-1, 64, 160, 160]          36,928
      BatchNorm2d-46         [-1, 64, 160, 160]             128
             ReLU-47         [-1, 64, 160, 160]               0
           Conv2d-48        [-1, 128, 160, 160]           8,320
      BatchNorm2d-49        [-1, 128, 160, 160]             256
         ResBlock-50        [-1, 128, 160, 160]               0
           Conv2d-51         [-1, 64, 160, 160]           8,256
      BatchNorm2d-52         [-1, 64, 160, 160]             128
             ReLU-53         [-1, 64, 160, 160]               0
           Conv2d-54         [-1, 64, 160, 160]          36,928
      BatchNorm2d-55         [-1, 64, 160, 160]             128
             ReLU-56         [-1, 64, 160, 160]               0
           Conv2d-57        [-1, 128, 160, 160]           8,320
      BatchNorm2d-58        [-1, 128, 160, 160]             256
         ResBlock-59        [-1, 128, 160, 160]               0
           Conv2d-60           [-1, 64, 80, 80]          73,792
             ReLU-61           [-1, 64, 80, 80]               0
      BatchNorm2d-62           [-1, 64, 80, 80]             128
             ReLU-63           [-1, 64, 80, 80]               0
           Conv2d-64         [-1, 64, 160, 160]           8,256
      BatchNorm2d-65         [-1, 64, 160, 160]             128
             ReLU-66         [-1, 64, 160, 160]               0
           Conv2d-67          [-1, 128, 80, 80]          16,512
      BatchNorm2d-68          [-1, 128, 80, 80]             256
             ReLU-69          [-1, 128, 80, 80]               0
           Conv2d-70          [-1, 128, 80, 80]         147,584
      BatchNorm2d-71          [-1, 128, 80, 80]             256
             ReLU-72          [-1, 128, 80, 80]               0
           Conv2d-73          [-1, 128, 80, 80]          16,512
      BatchNorm2d-74          [-1, 128, 80, 80]             256
         ResBlock-75          [-1, 128, 80, 80]               0
           Conv2d-76          [-1, 128, 80, 80]          16,512
      BatchNorm2d-77          [-1, 128, 80, 80]             256
           Conv2d-78          [-1, 128, 80, 80]          16,512
      BatchNorm2d-79          [-1, 128, 80, 80]             256
             ReLU-80          [-1, 128, 80, 80]               0
           Conv2d-81          [-1, 128, 80, 80]         147,584
      BatchNorm2d-82          [-1, 128, 80, 80]             256
             ReLU-83          [-1, 128, 80, 80]               0
           Conv2d-84          [-1, 128, 80, 80]          16,512
      BatchNorm2d-85          [-1, 128, 80, 80]             256
         ResBlock-86          [-1, 128, 80, 80]               0
           Conv2d-87          [-1, 128, 80, 80]          16,512
      BatchNorm2d-88          [-1, 128, 80, 80]             256
             ReLU-89          [-1, 128, 80, 80]               0
           Conv2d-90          [-1, 128, 80, 80]         147,584
      BatchNorm2d-91          [-1, 128, 80, 80]             256
             ReLU-92          [-1, 128, 80, 80]               0
           Conv2d-93          [-1, 128, 80, 80]          16,512
      BatchNorm2d-94          [-1, 128, 80, 80]             256
         ResBlock-95          [-1, 128, 80, 80]               0
           Conv2d-96          [-1, 128, 80, 80]          16,512
      BatchNorm2d-97          [-1, 128, 80, 80]             256
             ReLU-98          [-1, 128, 80, 80]               0
           Conv2d-99          [-1, 128, 80, 80]         147,584
     BatchNorm2d-100          [-1, 128, 80, 80]             256
            ReLU-101          [-1, 128, 80, 80]               0
          Conv2d-102          [-1, 128, 80, 80]          16,512
     BatchNorm2d-103          [-1, 128, 80, 80]             256
        ResBlock-104          [-1, 128, 80, 80]               0
          Conv2d-105           [-1, 64, 40, 40]          73,792
            ReLU-106           [-1, 64, 40, 40]               0
     BatchNorm2d-107           [-1, 64, 40, 40]             128
            ReLU-108           [-1, 64, 40, 40]               0
          Conv2d-109           [-1, 64, 80, 80]           8,256
     BatchNorm2d-110           [-1, 64, 80, 80]             128
            ReLU-111           [-1, 64, 80, 80]               0
          Conv2d-112          [-1, 128, 40, 40]          16,512
     BatchNorm2d-113          [-1, 128, 40, 40]             256
            ReLU-114          [-1, 128, 40, 40]               0
          Conv2d-115          [-1, 128, 40, 40]         147,584
     BatchNorm2d-116          [-1, 128, 40, 40]             256
            ReLU-117          [-1, 128, 40, 40]               0
          Conv2d-118          [-1, 256, 40, 40]          33,024
     BatchNorm2d-119          [-1, 256, 40, 40]             512
        ResBlock-120          [-1, 256, 40, 40]               0
          Conv2d-121          [-1, 256, 40, 40]          33,024
     BatchNorm2d-122          [-1, 256, 40, 40]             512
          Conv2d-123          [-1, 128, 40, 40]          32,896
     BatchNorm2d-124          [-1, 128, 40, 40]             256
            ReLU-125          [-1, 128, 40, 40]               0
          Conv2d-126          [-1, 128, 40, 40]         147,584
     BatchNorm2d-127          [-1, 128, 40, 40]             256
            ReLU-128          [-1, 128, 40, 40]               0
          Conv2d-129          [-1, 256, 40, 40]          33,024
     BatchNorm2d-130          [-1, 256, 40, 40]             512
        ResBlock-131          [-1, 256, 40, 40]               0
          Conv2d-132          [-1, 128, 40, 40]          32,896
     BatchNorm2d-133          [-1, 128, 40, 40]             256
            ReLU-134          [-1, 128, 40, 40]               0
          Conv2d-135          [-1, 128, 40, 40]         147,584
     BatchNorm2d-136          [-1, 128, 40, 40]             256
            ReLU-137          [-1, 128, 40, 40]               0
          Conv2d-138          [-1, 256, 40, 40]          33,024
     BatchNorm2d-139          [-1, 256, 40, 40]             512
        ResBlock-140          [-1, 256, 40, 40]               0
          Conv2d-141          [-1, 128, 40, 40]          32,896
     BatchNorm2d-142          [-1, 128, 40, 40]             256
            ReLU-143          [-1, 128, 40, 40]               0
          Conv2d-144          [-1, 128, 40, 40]         147,584
     BatchNorm2d-145          [-1, 128, 40, 40]             256
            ReLU-146          [-1, 128, 40, 40]               0
          Conv2d-147          [-1, 256, 40, 40]          33,024
     BatchNorm2d-148          [-1, 256, 40, 40]             512
        ResBlock-149          [-1, 256, 40, 40]               0
          Conv2d-150          [-1, 128, 40, 40]          32,896
     BatchNorm2d-151          [-1, 128, 40, 40]             256
            ReLU-152          [-1, 128, 40, 40]               0
          Conv2d-153          [-1, 128, 40, 40]         147,584
     BatchNorm2d-154          [-1, 128, 40, 40]             256
            ReLU-155          [-1, 128, 40, 40]               0
          Conv2d-156          [-1, 256, 40, 40]          33,024
     BatchNorm2d-157          [-1, 256, 40, 40]             512
        ResBlock-158          [-1, 256, 40, 40]               0
          Conv2d-159          [-1, 128, 40, 40]          32,896
     BatchNorm2d-160          [-1, 128, 40, 40]             256
            ReLU-161          [-1, 128, 40, 40]               0
          Conv2d-162          [-1, 128, 40, 40]         147,584
     BatchNorm2d-163          [-1, 128, 40, 40]             256
            ReLU-164          [-1, 128, 40, 40]               0
          Conv2d-165          [-1, 256, 40, 40]          33,024
     BatchNorm2d-166          [-1, 256, 40, 40]             512
        ResBlock-167          [-1, 256, 40, 40]               0
          Conv2d-168           [-1, 64, 40, 40]          16,448
     BatchNorm2d-169           [-1, 64, 40, 40]             128
            ReLU-170           [-1, 64, 40, 40]               0
          Conv2d-171          [-1, 128, 20, 20]          32,896
     BatchNorm2d-172          [-1, 128, 20, 20]             256
            ReLU-173          [-1, 128, 20, 20]               0
          Conv2d-174          [-1, 128, 20, 20]         147,584
     BatchNorm2d-175          [-1, 128, 20, 20]             256
            ReLU-176          [-1, 128, 20, 20]               0
          Conv2d-177          [-1, 256, 20, 20]          33,024
     BatchNorm2d-178          [-1, 256, 20, 20]             512
        ResBlock-179          [-1, 256, 20, 20]               0
          Conv2d-180          [-1, 256, 20, 20]          65,792
     BatchNorm2d-181          [-1, 256, 20, 20]             512
          Conv2d-182          [-1, 128, 20, 20]          32,896
     BatchNorm2d-183          [-1, 128, 20, 20]             256
            ReLU-184          [-1, 128, 20, 20]               0
          Conv2d-185          [-1, 128, 20, 20]         147,584
     BatchNorm2d-186          [-1, 128, 20, 20]             256
            ReLU-187          [-1, 128, 20, 20]               0
          Conv2d-188          [-1, 256, 20, 20]          33,024
     BatchNorm2d-189          [-1, 256, 20, 20]             512
        ResBlock-190          [-1, 256, 20, 20]               0
          Conv2d-191          [-1, 128, 20, 20]          32,896
     BatchNorm2d-192          [-1, 128, 20, 20]             256
            ReLU-193          [-1, 128, 20, 20]               0
          Conv2d-194          [-1, 128, 20, 20]         147,584
     BatchNorm2d-195          [-1, 128, 20, 20]             256
            ReLU-196          [-1, 128, 20, 20]               0
          Conv2d-197          [-1, 256, 20, 20]          33,024
     BatchNorm2d-198          [-1, 256, 20, 20]             512
        ResBlock-199          [-1, 256, 20, 20]               0
          Conv2d-200          [-1, 128, 20, 20]          32,768
     BatchNorm2d-201          [-1, 128, 20, 20]             256
            ReLU-202          [-1, 128, 20, 20]               0
          Conv2d-203          [-1, 256, 20, 20]           2,304
     BatchNorm2d-204          [-1, 256, 20, 20]             512
            ReLU-205          [-1, 256, 20, 20]               0
          Conv2d-206          [-1, 128, 20, 20]          32,768
          Conv2d-207          [-1, 256, 20, 20]           2,304
     BatchNorm2d-208          [-1, 256, 20, 20]             512
            ReLU-209          [-1, 256, 20, 20]               0
          Conv2d-210          [-1, 128, 20, 20]          32,768
          Conv2d-211          [-1, 256, 20, 20]           2,304
     BatchNorm2d-212          [-1, 256, 20, 20]             512
            ReLU-213          [-1, 256, 20, 20]               0
          Conv2d-214          [-1, 128, 20, 20]          32,768
AdaptiveAvgPool2d-215            [-1, 256, 1, 1]               0
          Conv2d-216            [-1, 128, 1, 1]          32,768
     BatchNorm2d-217            [-1, 128, 1, 1]             256
            ReLU-218            [-1, 128, 1, 1]               0
UpsamplingBilinear2d-219          [-1, 128, 20, 20]               0
            Aspp-220          [-1, 640, 20, 20]               0
          Conv2d-221          [-1, 256, 20, 20]         164,096
     BatchNorm2d-222          [-1, 256, 20, 20]             512
            ReLU-223          [-1, 256, 20, 20]               0
    PixelShuffle-224           [-1, 64, 40, 40]               0
     BatchNorm2d-225           [-1, 64, 40, 40]             128
            ReLU-226           [-1, 64, 40, 40]               0
          Conv2d-227           [-1, 64, 40, 40]          73,792
     BatchNorm2d-228           [-1, 64, 40, 40]             128
            ReLU-229           [-1, 64, 40, 40]               0
          Conv2d-230          [-1, 128, 40, 40]         147,584
     BatchNorm2d-231          [-1, 128, 40, 40]             256
            ReLU-232          [-1, 128, 40, 40]               0
          Conv2d-233          [-1, 256, 40, 40]         295,168
     BatchNorm2d-234          [-1, 256, 40, 40]             512
            ReLU-235          [-1, 256, 40, 40]               0
    PixelShuffle-236           [-1, 64, 80, 80]               0
     BatchNorm2d-237           [-1, 64, 80, 80]             128
            ReLU-238           [-1, 64, 80, 80]               0
          Conv2d-239           [-1, 64, 80, 80]          73,792
     BatchNorm2d-240           [-1, 64, 80, 80]             128
            ReLU-241           [-1, 64, 80, 80]               0
          Conv2d-242          [-1, 128, 80, 80]         147,584
     BatchNorm2d-243          [-1, 128, 80, 80]             256
            ReLU-244          [-1, 128, 80, 80]               0
          Conv2d-245          [-1, 256, 80, 80]         295,168
     BatchNorm2d-246          [-1, 256, 80, 80]             512
            ReLU-247          [-1, 256, 80, 80]               0
    PixelShuffle-248         [-1, 64, 160, 160]               0
     BatchNorm2d-249         [-1, 64, 160, 160]             128
            ReLU-250         [-1, 64, 160, 160]               0
          Conv2d-251         [-1, 64, 160, 160]          73,792
     BatchNorm2d-252         [-1, 64, 160, 160]             128
            ReLU-253         [-1, 64, 160, 160]               0
          Conv2d-254        [-1, 128, 160, 160]         147,584
     BatchNorm2d-255        [-1, 128, 160, 160]             256
            ReLU-256        [-1, 128, 160, 160]               0
          Conv2d-257        [-1, 256, 160, 160]         295,168
     BatchNorm2d-258        [-1, 256, 160, 160]             512
            ReLU-259        [-1, 256, 160, 160]               0
    PixelShuffle-260         [-1, 64, 320, 320]               0
     BatchNorm2d-261         [-1, 64, 320, 320]             128
            ReLU-262         [-1, 64, 320, 320]               0
          Conv2d-263        [-1, 128, 320, 320]         147,584
     BatchNorm2d-264        [-1, 128, 320, 320]             256
            ReLU-265        [-1, 128, 320, 320]               0
          Conv2d-266        [-1, 128, 320, 320]         147,584
     BatchNorm2d-267        [-1, 128, 320, 320]             256
            ReLU-268        [-1, 128, 320, 320]               0
          Conv2d-269          [-1, 2, 320, 320]           2,306
         Sigmoid-270          [-1, 2, 320, 320]               0
          Conv2d-271          [-1, 2, 320, 320]           2,306
         Sigmoid-272          [-1, 2, 320, 320]               0
          Conv2d-273          [-1, 2, 320, 320]           2,306
         Sigmoid-274          [-1, 2, 320, 320]               0
          Conv2d-275          [-1, 2, 320, 320]           2,306
         Sigmoid-276          [-1, 2, 320, 320]               0
          Conv2d-277          [-1, 2, 320, 320]           2,306
         Sigmoid-278          [-1, 2, 320, 320]               0
          Conv2d-279          [-1, 2, 320, 320]           2,306
         Sigmoid-280          [-1, 2, 320, 320]               0
          Conv2d-281          [-1, 2, 320, 320]           2,306
         Sigmoid-282          [-1, 2, 320, 320]               0
          Conv2d-283          [-1, 2, 320, 320]           2,306
         Sigmoid-284          [-1, 2, 320, 320]               0
          Conv2d-285          [-1, 8, 320, 320]           1,032
            ReLU-286          [-1, 8, 320, 320]               0
     BatchNorm2d-287          [-1, 8, 320, 320]              16
         Sigmoid-288          [-1, 8, 320, 320]               0
          Conv2d-289         [-1, 16, 320, 320]           3,472
            ReLU-290         [-1, 16, 320, 320]               0
          Conv2d-291         [-1, 16, 320, 320]           2,320
            ReLU-292         [-1, 16, 320, 320]               0
          Conv2d-293          [-1, 8, 320, 320]           1,160
            ReLU-294          [-1, 8, 320, 320]               0
          Conv2d-295          [-1, 1, 320, 320]               9
         Sigmoid-296          [-1, 1, 320, 320]               0
================================================================
Total params: 5,366,425
Trainable params: 5,366,425
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.17
Forward/backward pass size (MB): 3296.10
Params size (MB): 20.47
Estimated Total Size (MB): 3317.74
----------------------------------------------------------------

Process finished with exit code 0
